#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=3a8e1016abda88ea7c261d4a5ef5aad8d766efde]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=e5094e337d97bf663bebb451657f5785a9dda36d]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.http-redirect.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:615299762949:certificate/c69ccd6e-eece-4944-b5d5-e191ea5376aa]
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.data.aws_region.current: Reading...
module.http-redirect.data.aws_route53_zone.zone: Reading...
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
data.aws_caller_identity.current: Reading...
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.http-redirect.aws_cloudfront_function.redirect: Refreshing state... [id=http-redirect]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.http-redirect.data.aws_route53_zone.zone: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.http-redirect.aws_route53_record.cert_validation["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA__abc41aced5334d86bdd43adac171c372.victorlevasseur.tech._CNAME]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 1s [id=109063c51c5e8592a8b59a777d7b2e2ef8d040d8]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.http-redirect.aws_acm_certificate_validation.cert: Refreshing state... [id=2025-02-13 14:11:52.205 +0000 UTC]
module.http-redirect.aws_cloudfront_distribution.distribution: Refreshing state... [id=E3AXV12PY17NPX]
module.http-redirect.aws_route53_record.main["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 0s [id=vltech-website-website-origin-aliases]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/cgv"]: Refreshing state... [id=9133ee1f-db0a-a752-0927-128cdb6ca70d]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico/route"]: Refreshing state... [id=8edeced0-948e-835f-0d5f-eaa602012e58]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/cgv"]: Refreshing state... [id=3df64e48-18cc-267c-e25d-6e01733e8dff]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg"]: Refreshing state... [id=fe217493-6a00-1150-7317-32bdc8b5a8f7]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/sitemap.xml"]: Refreshing state... [id=c3456a20-782d-96f9-6b67-c4088c655f7d]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/page"]: Refreshing state... [id=748bc004-efda-6325-2830-ca5e3e92f86b]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml/layout"]: Refreshing state... [id=20b4110b-c80f-e3eb-5e67-9d59a3cce903]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg/route"]: Refreshing state... [id=2b5ce989-3db8-9076-e560-2cecd65a0a5a]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/icon.svg"]: Refreshing state... [id=93ccee1f-894c-9a1d-dfdb-8155a595762b]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/apple-icon.png"]: Refreshing state... [id=b4f8495e-a714-f335-c5cc-97e3447f49ce]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml/route"]: Refreshing state... [id=2dd4e40f-4aaf-2bbf-902a-0fc33eb1b7f4]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/_not-found/layout"]: Refreshing state... [id=26c262a5-9994-10a5-c564-810be6dd9cfe]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg/layout"]: Refreshing state... [id=ce473ce0-3223-e03d-5559-de1b050c940d]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/"]: Refreshing state... [id=348e66e5-7cdc-df41-e44b-b259a9cfb4d6]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=5bf8a164-a331-b6b6-c102-6e74dd1bac80]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/_not-found"]: Refreshing state... [id=e6c02ad3-8b05-19bb-8ffd-7f5f906c1378]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/favicon.ico"]: Refreshing state... [id=fc58b564-ce1a-7a6b-1039-e7c49e48a84f]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png/route"]: Refreshing state... [id=1a77e226-378d-7423-7700-d57764b3558e]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/cgv/layout"]: Refreshing state... [id=08cd8b35-b939-6b2e-67e6-6b76084a911b]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/cgv/page"]: Refreshing state... [id=5f86e505-579e-13c7-dcdc-3ddccbb2c637]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/_not-found/page"]: Refreshing state... [id=386387f5-4cf8-cf61-2c2f-638f4c1ea6ec]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/index"]: Refreshing state... [id=15dd2205-da17-ec74-0aac-ea65f3ff7db1]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico/layout"]: Refreshing state... [id=b91655d3-9439-5f5e-6027-254d2da85acf]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico"]: Refreshing state... [id=1d8e639e-9b93-f4b5-cfb2-559df5a3e724]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/_not-found"]: Refreshing state... [id=3a5a2ebc-f045-f4dd-c96d-40037391422f]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png"]: Refreshing state... [id=e563ebf4-7bda-1c27-c76c-7d3bc55cbd25]
module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml"]: Refreshing state... [id=7fdc04dc-670b-b970-c853-f4f10e907d6f]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=f4d229bf-2e08-d586-54f3-67fb07296e11]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-b5896372898a26b5.js"]: Refreshing state... [id=bc9d1baf-5248-765c-dec3-717d504374f3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/01b81fc6c4002686.css"]: Refreshing state... [id=de26967e-7b67-5a54-f6e4-3b45a00acb1c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/978-2e23e15eb2d9825e.js"]: Refreshing state... [id=08c3e02a-0a97-2c74-2cfe-bc127cd57f15]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/cgv/page-2f9874ecc3099b18.js"]: Refreshing state... [id=34f45cf6-bb8a-9b44-d95d-0c917d12f956]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-dbf93d4b3b66ee0d.js"]: Refreshing state... [id=f70e794e-46fc-f612-0b45-1bcaab0b96a8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/PblAKYIILMWv8A950qLBe/_ssgManifest.js"]: Refreshing state... [id=503931ab-cf7a-e455-c478-4c2e5dfc2a37]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=2a93b37f-5f01-f926-2017-8f30baea5dd5]
module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/cgv.cache"]: Refreshing state... [id=6787fd64-0090-cf2b-9482-0a806fe5aa2a]
module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/_not-found.cache"]: Refreshing state... [id=fb92d555-e64c-3517-79fa-c4ee7e791ce1]
module.single_zone.module.s3_assets.terraform_data.file_sync["documents/cgv.pdf"]: Refreshing state... [id=c76dce72-1386-d74a-4047-b8fa9d7b4f05]
module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/500.cache"]: Refreshing state... [id=c37084c7-65fa-649c-6211-b1bcb9072f4a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/b8022cc0231a4bfd.css"]: Refreshing state... [id=715e82b9-4752-4d03-4e14-bba9b5b369bd]
module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/icon.svg.cache"]: Refreshing state... [id=d597dfe8-8c8e-9191-224e-dfd479de7ec4]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"]: Refreshing state... [id=fbe0b5a6-0ff9-f248-fb8d-1f39b44a8105]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/173-fc558b54b5be890b.js"]: Refreshing state... [id=bae8c547-8fd3-1d15-a8aa-1e2e1fb9c4d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-c579319bb9b05615.js"]: Refreshing state... [id=ac913217-a6e6-32d9-66ab-7bca99b23029]
module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/sitemap.xml.cache"]: Refreshing state... [id=16635aa5-3dfd-528f-3450-976e37f7d58d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-984cbc839a680ab5.js"]: Refreshing state... [id=0326f31c-3e63-6c97-3dcd-1937ad8c78fc]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/PblAKYIILMWv8A950qLBe/_buildManifest.js"]: Refreshing state... [id=4b1daa41-de16-bba7-35cf-cee40797dc0f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["assets/vltech_logo.png"]: Refreshing state... [id=5580fd80-287a-0715-aa66-6da5c311462b]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/index.cache"]: Refreshing state... [id=849eb9d9-cea3-e119-84c4-ab4d66a2fc6c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-47d8fb00497672e4.js"]: Refreshing state... [id=a6a618da-575c-c65c-ffec-d19aeebed804]
module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/apple-icon.png.cache"]: Refreshing state... [id=ab154986-987f-d399-435d-02091f9eab7a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-b2447a23980919fd.js"]: Refreshing state... [id=86b17e9c-0ff0-125e-e384-6bbaf9c2d977]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/favicon.ico.cache"]: Refreshing state... [id=a9a01190-490d-5db1-95c3-b34056a8556a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=2422b8d8-d6e1-00b9-7308-842205454ee8]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=32743f22238efdfe52c3c511c90c0ebfff0d5f34]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=46fa0c91-e701-5f14-f24d-9337fed1f529]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=49c58d79-1f33-2d00-f3ea-d2bf33d20bfb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f2a8ad1ec16bac2f0321e7e259aaf054",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "fb8582f6185c98822ebb7830ffd88a24",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "1f6cc969cbe0adb57b3e5994eca9c1e9",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "7cf929185fa096b2f9e8f53ea00900cc",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d8fe34855bc602c1b4baffd57b4b5c2a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/apple-icon.png/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f18d692c2e6afcf0a7de752423302c3f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/apple-icon.png/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "48982e3bdbb9b8ad33ff0c6a02432f31",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "40b11038a2aeacff3fb3e7aa74a8b9a3",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/cgv/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "354ea8ea2df889014c8885d6eabce39d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/cgv/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "022f651aca97672503552be1be679317",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "edb0d3ef76bea5ac554278c0356c6a5f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b7d6f8e78c9ea79ee57b915764c86b92",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6b95621fc5c366390d07f6ae5b75da29",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "209810640964449a1738333da5c72c94",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/icon.svg/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6b5eec63bdeea58fc2fc7a6c673e02d4",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/icon.svg/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c93d3427a4c86bf369bae86d57903071",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/layout-4LSs_DjnTFV1_WaxFVOJ4/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "7ce0ce46fa8b9106fe55328bfe8063ea",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/layout-4LSs_DjnTFV1_WaxFVOJ4/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "8110bc4eda5ae7224abc8db8fd4ab757",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/layout-4LSs_DjnTFV1_WaxFVOJ4/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "bd555e1c88278745c1e6deb5ee85d60c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/layout-4LSs_DjnTFV1_WaxFVOJ4/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "78352a8c5019e242020f66ae34796cbf",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/layout-4LSs_DjnTFV1_WaxFVOJ4/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "dff5cd97f22a3543dda96ff4ecf0f7b0",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/layout-4LSs_DjnTFV1_WaxFVOJ4/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e5907e8c51f1a0fe0a5d6a08262b04b7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/layout-4LSs_DjnTFV1_WaxFVOJ4/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f7c196952903d36df1031df060b3d387",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "01d17eaec2d84f0ee6e979c6e121d763",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d1bb54407b9e3a53ec3f8b1387366cf4",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/sitemap.xml/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "34b0c88b8bff09ab5f240d8ab02228fe",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["4LSs_DjnTFV1_WaxFVOJ4/_N_T_/sitemap.xml/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "93d4e38fcee6d97ba097921aee6878b3",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "348e66e5-7cdc-df41-e44b-b259a9cfb4d6" -> null
      - triggers_replace = [
          - "nextjs",
          - "a0dcf75f90509855d3b89123902cf02d",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/_not-found"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e6c02ad3-8b05-19bb-8ffd-7f5f906c1378" -> null
      - triggers_replace = [
          - "nextjs",
          - "b9f9a3f2049c78f463918b3b268f3d8a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "26c262a5-9994-10a5-c564-810be6dd9cfe" -> null
      - triggers_replace = [
          - "nextjs",
          - "4b65f2e11f858ec03534a26e6e6e4542",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/_not-found/page"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "386387f5-4cf8-cf61-2c2f-638f4c1ea6ec" -> null
      - triggers_replace = [
          - "nextjs",
          - "d0f527737bcb4b47f22d8bdf53bfae6e",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e563ebf4-7bda-1c27-c76c-7d3bc55cbd25" -> null
      - triggers_replace = [
          - "nextjs",
          - "81699c26b3b1ef3cb1c5dfc8760b5afe",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "5bf8a164-a331-b6b6-c102-6e74dd1bac80" -> null
      - triggers_replace = [
          - "nextjs",
          - "f93e80f6baf181e907412d9dfc55d5a6",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1a77e226-378d-7423-7700-d57764b3558e" -> null
      - triggers_replace = [
          - "nextjs",
          - "399569dd6ccc993730ff41e4f0611354",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/cgv"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "9133ee1f-db0a-a752-0927-128cdb6ca70d" -> null
      - triggers_replace = [
          - "nextjs",
          - "76a0d47bb148867614f53acec7b5123d",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/cgv/layout"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/cgv/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "08cd8b35-b939-6b2e-67e6-6b76084a911b" -> null
      - triggers_replace = [
          - "nextjs",
          - "6c9fd8150853896cee9ed5a042626e24",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/cgv/page"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/cgv/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "5f86e505-579e-13c7-dcdc-3ddccbb2c637" -> null
      - triggers_replace = [
          - "nextjs",
          - "ba1ca38b05ddc2db25dac7c1e2a35f20",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1d8e639e-9b93-f4b5-cfb2-559df5a3e724" -> null
      - triggers_replace = [
          - "nextjs",
          - "cb6afc71e2a023a5aa3d4afa460e641f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b91655d3-9439-5f5e-6027-254d2da85acf" -> null
      - triggers_replace = [
          - "nextjs",
          - "545aca73b6e045741117a6ddb9b37ccc",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "8edeced0-948e-835f-0d5f-eaa602012e58" -> null
      - triggers_replace = [
          - "nextjs",
          - "a8c80d93b3a6f8f8493c1c14a86e9089",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "fe217493-6a00-1150-7317-32bdc8b5a8f7" -> null
      - triggers_replace = [
          - "nextjs",
          - "dbecde3aa6daf57714012706988662c7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ce473ce0-3223-e03d-5559-de1b050c940d" -> null
      - triggers_replace = [
          - "nextjs",
          - "10c8c1115488022d022e01c08fc1e491",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2b5ce989-3db8-9076-e560-2cecd65a0a5a" -> null
      - triggers_replace = [
          - "nextjs",
          - "eddda4d504208593e17afeb4aa91f34c",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/_not-found"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "3a5a2ebc-f045-f4dd-c96d-40037391422f" -> null
      - triggers_replace = [
          - "nextjs",
          - "89f5b93e9c2ec309ff41c5d3d447bc9b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/apple-icon.png"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b4f8495e-a714-f335-c5cc-97e3447f49ce" -> null
      - triggers_replace = [
          - "nextjs",
          - "a2e43a5508e703e23288a46ccf95d8a5",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/cgv"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "3df64e48-18cc-267c-e25d-6e01733e8dff" -> null
      - triggers_replace = [
          - "nextjs",
          - "0b7f646c08a5d22055330439cdb0a7e7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/favicon.ico"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "fc58b564-ce1a-7a6b-1039-e7c49e48a84f" -> null
      - triggers_replace = [
          - "nextjs",
          - "dabd72f96dc7a27507a11b9021ac90d7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/icon.svg"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "93ccee1f-894c-9a1d-dfdb-8155a595762b" -> null
      - triggers_replace = [
          - "nextjs",
          - "fdd75c7624efb885a7b4cf7c6031ac43",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/index"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "15dd2205-da17-ec74-0aac-ea65f3ff7db1" -> null
      - triggers_replace = [
          - "nextjs",
          - "926cfe9650f80f088bd83d2a5b8a9181",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/sitemap.xml"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/layout-PblAKYIILMWv8A950qLBe/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "c3456a20-782d-96f9-6b67-c4088c655f7d" -> null
      - triggers_replace = [
          - "nextjs",
          - "edd9554d5ad144310ac374a11b5fe3e3",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/page"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "748bc004-efda-6325-2830-ca5e3e92f86b" -> null
      - triggers_replace = [
          - "nextjs",
          - "2215fbd87ca09e0297d2a9468cb538f8",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "7fdc04dc-670b-b970-c853-f4f10e907d6f" -> null
      - triggers_replace = [
          - "nextjs",
          - "a9248512f5b45c58442c928a7543456a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml/layout"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "20b4110b-c80f-e3eb-5e67-9d59a3cce903" -> null
      - triggers_replace = [
          - "nextjs",
          - "c5f9bba7d07d5dda196c9d73feb1d87b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml/route"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_N_T_/sitemap.xml/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2dd4e40f-4aaf-2bbf-902a-0fc33eb1b7f4" -> null
      - triggers_replace = [
          - "nextjs",
          - "8029f76112f72275bf66171c5d043082",
        ] -> null
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-24T16:03:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:27" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:27/invocations" -> (known after apply)
      ~ source_code_hash               = "cwur2tIO7P2AvsIVX4h4o+2UED0F8Xlw4yQKKsr6sDE=" -> "guWeeKpj/f0CJciEzyVYg8uU0+CAel9M31LCIDF9rTM="
        tags                           = {}
      ~ version                        = "27" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "2422b8d8-d6e1-00b9-7308-842205454ee8" -> (known after apply)
      ~ triggers_replace = [
          ~ "27" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-24T16:03:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:27" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:27/invocations" -> (known after apply)
      ~ source_code_hash               = "k/feVRBR65yjU7dymp+x6AmofxaDO3p3W3atyo9MaHY=" -> "fWahliK3g2/pHDi5bwA6t8fhgXYmCXRNx0lfB9AeJrE="
        tags                           = {}
      ~ version                        = "27" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "f4d229bf-2e08-d586-54f3-67fb07296e11" -> (known after apply)
      ~ triggers_replace = [
          ~ "27" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["4LSs_DjnTFV1_WaxFVOJ4/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "e6a4c5e0fece00a62f77e5b2ef833f44",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["4LSs_DjnTFV1_WaxFVOJ4/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "daddd02fdda78c159ddfc8011b34893f",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["4LSs_DjnTFV1_WaxFVOJ4/apple-icon.png.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9843a61c98627e227286769373becd10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["4LSs_DjnTFV1_WaxFVOJ4/cgv.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "cb2232039d85c6b5be82f28084dfe034",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["4LSs_DjnTFV1_WaxFVOJ4/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1253a11e7fded511c766a255028ab4ee",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["4LSs_DjnTFV1_WaxFVOJ4/icon.svg.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "31e8b96a370a0c0409d732d5d9c1d2d6",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["4LSs_DjnTFV1_WaxFVOJ4/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "6328118b22babd1d8cd7318bb13b0c39",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["4LSs_DjnTFV1_WaxFVOJ4/sitemap.xml.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "21fbdc8e178c2542fca1ca2be032d051",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "2a93b37f-5f01-f926-2017-8f30baea5dd5" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "db8a2096d4c6f23a5ca101e2367d7022" -> "d27f20ad7d78385ae17826ba131bb6f4",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/500.cache"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "c37084c7-65fa-649c-6211-b1bcb9072f4a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "e588c71c00646c229852e98abe5acc67",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/_not-found.cache"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "fb92d555-e64c-3517-79fa-c4ee7e791ce1" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "153f1177408ee73b995071ce41218480",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/apple-icon.png.cache"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "ab154986-987f-d399-435d-02091f9eab7a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/cgv.cache"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/cgv.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "6787fd64-0090-cf2b-9482-0a806fe5aa2a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "943543908e4e9d6cd676265344258416",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/favicon.ico.cache"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "a9a01190-490d-5db1-95c3-b34056a8556a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/icon.svg.cache"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "d597dfe8-8c8e-9191-224e-dfd479de7ec4" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/index.cache"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "849eb9d9-cea3-e119-84c4-ab4d66a2fc6c" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "55ff05c619d81bf10ef336053e416452",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["PblAKYIILMWv8A950qLBe/sitemap.xml.cache"] will be destroyed
  # (because key ["PblAKYIILMWv8A950qLBe/sitemap.xml.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "16635aa5-3dfd-528f-3450-976e37f7d58d" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "863f7afda6b1906dd34921eb5bbc8e60",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/4LSs_DjnTFV1_WaxFVOJ4/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9a9bc883f7801dfd30597cebfafa30d0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/4LSs_DjnTFV1_WaxFVOJ4/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/PblAKYIILMWv8A950qLBe/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/PblAKYIILMWv8A950qLBe/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "4b1daa41-de16-bba7-35cf-cee40797dc0f" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a9bc883f7801dfd30597cebfafa30d0",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/PblAKYIILMWv8A950qLBe/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/PblAKYIILMWv8A950qLBe/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "503931ab-cf7a-e455-c478-4c2e5dfc2a37" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-24T16:03:44.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:27" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:27/invocations" -> (known after apply)
      ~ source_code_hash               = "Rnv9KhQhsiKGhs9KVTxtvcw3y2yYqmKlhJXJ6CWvJpQ=" -> "rSDb/u0BGzYOeb9XpQMr4tbzLHK15vzOBgKA//r/duE="
        tags                           = {}
      ~ version                        = "27" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "46fa0c91-e701-5f14-f24d-9337fed1f529" -> (known after apply)
      ~ triggers_replace = [
          ~ "27" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 41 to add, 3 to change, 41 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*